cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Binaries
brew 'bat'
brew 'tree'
brew 'git'
brew 'grep'
brew 'ripgrep'
brew 'zsh'
brew 'vim', args: ['with-override-system-vi']
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'fzf'

# Development
brew 'node'
brew 'python'
brew 'python3'

# Applications
cask 'iterm2'
cask 'flux'
cask 'google-chrome'
cask 'spotify'
cask 'slack'
cask 'docker'
cask 'notion'
cask 'ngrok'
