cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Binaries
brew 'bat'
brew 'tree'
brew 'git'
brew 'grep'
brew 'ripgrep'
brew 'zsh'
brew 'vim'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'fzf'
brew 'tldr'
brew 'hugo'

# Development
brew 'node'
brew 'python'
brew 'python3'
brew 'rustup'

# Applications
cask 'alacritty'
cask 'flux'
cask 'google-chrome'
cask 'brave-browser'
cask 'spotify'
cask 'slack'
cask 'docker'
cask 'notion'
cask 'ngrok'
cask 'logitech-options'
